app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "12323"], ["user_id", 1], ["created_at", "2024-11-21 08:58:45.070378"], ["updated_at", "2024-11-21 08:58:45.070378"]]
UPDATE "microposts" SET "updated_at" = ? WHERE "microposts"."id" = ?  [["updated_at", "2024-11-21 08:59:57.236051"], ["id", 306]]
---
  def create
    build_micropost
    attach_image
    if @micropost.save