app/controllers/password_resets_controller.rb

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2024-11-21 04:28:38.586135"], ["password_digest", "$2a$04$B5NxDiVbaJn9eXWfhG1p/.SiNFpyuXaFAz0o7O6sJ4SvBi4GS9W2a"], ["id", 762146111]]
---
  def update
    if params[:user][:password].empty? # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update(user_params) # Case (4)