app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 10)
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "remember_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2024-11-20 08:43:02.222303"], ["remember_digest", "$2a$04$sPybo/2en.63LkGsHb99hO9uXZmv02GUJa6HLOONel.yoED5dSUDC"], ["id", 950961012]]